In [3]:
import pandas as pd

In [5]:
odi=pd.read_csv('odi-batting.csv')

In [31]:
x=pd.Series([1,2],index=['a','c'])
x

a    1
c    2
dtype: int64

In [32]:
x.loc['c']

2

In [88]:
odi.iloc[0:20,[0,1]]

        Country            Player
0   Afghanistan  Mohammad Shahzad
1   Afghanistan  Mohammad Shahzad
2   Afghanistan  Mohammad Shahzad
3   Afghanistan  Mohammad Shahzad
4   Afghanistan  Mohammad Shahzad
5   Afghanistan  Mohammad Shahzad
6   Afghanistan  Mohammad Shahzad
7   Afghanistan  Mohammad Shahzad
8   Afghanistan  Mohammad Shahzad
9   Afghanistan  Mohammad Shahzad
10  Afghanistan  Mohammad Shahzad
11  Afghanistan  Mohammad Shahzad
12  Afghanistan  Mohammad Shahzad
13  Afghanistan  Mohammad Shahzad
14  Afghanistan  Mohammad Shahzad
15  Afghanistan  Mohammad Shahzad
16  Afghanistan     Mohammad Nabi
17  Afghanistan     Mohammad Nabi
18  Afghanistan     Mohammad Nabi
19  Afghanistan     Mohammad Nabi

In [33]:
x['c']

2

In [16]:
odi_summary=odi.describe()
odi_summary

               Runs     ScoreRate
count  55900.000000  55900.000000
mean      22.241413     65.314208
std       25.558363     44.213423
min        0.000000      0.000000
25%        4.000000     37.500000
50%       13.000000     62.660000
75%       32.000000     87.500000
max      200.000000    600.000000

In [17]:
odi_summary.loc[['std','max'],['Runs']]

           Runs
std   25.558363
max  200.000000

In [18]:
odi.head()

,Country,Player,Runs,ScoreRate,MatchDate,Ground,Versus,URL
0,Afghanistan,Mohammad Shahzad,118.0,97.52,2-16-2010,Sharjah CA Stadium,Canada,../Matches/MatchScorecard_ODI.asp?MatchCode=3087
1,Afghanistan,Mohammad Shahzad,110.0,99.09,9-1-2009,VRA Ground,Netherlands,../Matches/MatchScorecard_ODI.asp?MatchCode=3008
2,Afghanistan,Mohammad Shahzad,100.0,138.88,8-16-2010,Cambusdoon New Ground,Scotland,../Matches/MatchScorecard_ODI.asp?MatchCode=3164
3,Afghanistan,Mohammad Shahzad,82.0,75.92,7-10-2010,Hazelaarweg,Netherlands,../Matches/MatchScorecard_ODI.asp?MatchCode=3153
4,Afghanistan,Mohammad Shahzad,57.0,100.00,7-1-2010,Sportpark Westvliet,Canada,../Matches/MatchScorecard_ODI.asp?MatchCode=3135

In [19]:
odi.loc[4] #if you name of the row or name of column

Country                                           Afghanistan
Player                                       Mohammad Shahzad
Runs                                                       57
ScoreRate                                                 100
MatchDate                                            7-1-2010
Ground                                    Sportpark Westvliet
Versus                                                 Canada
URL          ../Matches/MatchScorecard_ODI.asp?MatchCode=3135
Name: 4, dtype: object

In [20]:
odi.iloc[4] # if you know position of column or position of row

Country                                           Afghanistan
Player                                       Mohammad Shahzad
Runs                                                       57
ScoreRate                                                 100
MatchDate                                            7-1-2010
Ground                                    Sportpark Westvliet
Versus                                                 Canada
URL          ../Matches/MatchScorecard_ODI.asp?MatchCode=3135
Name: 4, dtype: object

In [30]:
odi['Player'].value_counts().loc[['Sachin R Tendulkar','Rahul Dravid']]

Sachin R Tendulkar    442
Rahul Dravid          318
Name: Player, dtype: int64

In [24]:
if 'URL' in odi.columns:
    odi=odi.drop(['URL'],axis=1) # drop column based on label
odi.head()

,Country,Player,Runs,ScoreRate,MatchDate,Ground,Versus
0,Afghanistan,Mohammad Shahzad,118.0,97.52,2-16-2010,Sharjah CA Stadium,Canada
1,Afghanistan,Mohammad Shahzad,110.0,99.09,9-1-2009,VRA Ground,Netherlands
2,Afghanistan,Mohammad Shahzad,100.0,138.88,8-16-2010,Cambusdoon New Ground,Scotland
3,Afghanistan,Mohammad Shahzad,82.0,75.92,7-10-2010,Hazelaarweg,Netherlands
4,Afghanistan,Mohammad Shahzad,57.0,100.00,7-1-2010,Sportpark Westvliet,Canada

In [34]:
odi_summary1=odi_summary.drop(['max'],axis=0) # drop based on row by default axis is zero

In [35]:
odi_summary1

               Runs     ScoreRate
count  55900.000000  55900.000000
mean      22.241413     65.314208
std       25.558363     44.213423
min        0.000000      0.000000
25%        4.000000     37.500000
50%       13.000000     62.660000
75%       32.000000     87.500000

In [38]:
##Rename columns 
odi=odi.rename(columns={'ScoreRate':'StrikeRate'}) # if column name is not present it will ignore the column name
odi.head(1)

,Country,Player,Runs,StrikeRate,MatchDate,Ground,Versus
0,Afghanistan,Mohammad Shahzad,118.0,97.52,2-16-2010,Sharjah CA Stadium,Canada

In [39]:
#create a dataframe
df=pd.DataFrame({
    'product':['a','b','c'],
    'sales':[10,20,30]
    
})

In [40]:
df

  product  sales
0       a     10
1       b     20
2       c     30

In [42]:
df.loc[2,'sales']=50

In [43]:
df

  product  sales
0       a     10
1       b     20
2       c     50

In [44]:
df['product']=df['product'].replace('b','bb')

In [45]:
df

  product  sales
0       a     10
1      bb     20
2       c     50

In [46]:
#Identifying unique values

In [50]:
odi['Player'].nunique() # no of unique values in a column/series

1936

In [52]:
player_name=odi['Player'].unique() # all the unique values in array
len(player_name)

1936

# Sorting data frame

In [62]:
sachin_row=odi[(odi['Player']=='Sachin R Tendulkar')]
sachin_row.sort_values(['Runs','StrikeRate'],ascending=False)

,Country,Player,Runs,StrikeRate,MatchDate,Ground,Versus
15150,India,Sachin R Tendulkar,200.0,136.05,2-24-2010,Captain Roop Singh Stadium,South Africa
15151,India,Sachin R Tendulkar,186.0,124.00,11-8-1999,Lal Bahadur Shastri Stadium,New Zealand
15152,India,Sachin R Tendulkar,175.0,124.11,11-5-2009,Rajiv Gandhi International Stadium,Australia
15153,India,Sachin R Tendulkar,163.0,122.55,3-8-2009,AMI Stadium,New Zealand
15154,India,Sachin R Tendulkar,152.0,100.66,2-23-2003,City Oval,Namibia
...,...,...,...,...,...,...,...
15587,India,Sachin R Tendulkar,0.0,0.00,12-18-1989,Jinnah Stadium (Gujwranwala),Pakistan
15588,India,Sachin R Tendulkar,0.0,0.00,10-17-1994,Nahar Singh (Mayur) Stadium,West Indies
15589,India,Sachin R Tendulkar,0.0,0.00,1-23-1997,OUTsurance Oval,South Africa
15590,India,Sachin R Tendulkar,0.0,0.00,10-20-1994,Wankhede Stadium,West Indies
15591,India,Sachin R Tendulkar,0.0,0.00,9-17-1994,Sinhalese Sports Club Ground,Sri Lanka

In [68]:
df=pd.DataFrame({
    'prod':['a','c','b','f'],
    'sales':[10,12,12,14]
})
df=df.set_index('prod')
df

      sales
prod
a        10
c        12
b        12
f        14

In [70]:
df.sort_index()

      sales
prod
a        10
b        12
c        12
f        14

# Topics
- summary
- head
- describe
- info/dtypes
- filtering
- iloc vs loc
- sort_values,sort_index
- value_counts,nunique,unique
- set_index
- drop
-rank

In [73]:
import numpy as np
np.random.seed(1)

In [74]:
data=pd.DataFrame({
    'name':['a','b','c','d','e'],
    'balance':np.random.randint(1,1000,5),
    'defaults':np.random.randint(1,15,5)
})

In [77]:
# Ranking based on maximum value
data['rank_balance']=data['balance'].rank(ascending=False)
data

  name  balance  defaults  rank_balance
0    a       38        10           5.0
1    b      236        12           3.0
2    c      909         6           1.0
3    d       73         1           4.0
4    e      768         1           2.0

In [78]:
#ranking based on minimum value
data['rank_defaults']=data['defaults'].rank()
data

  name  balance  defaults  rank_balance  rank_defaults
0    a       38        10           5.0            4.0
1    b      236        12           3.0            5.0
2    c      909         6           1.0            3.0
3    d       73         1           4.0            1.5
4    e      768         1           2.0            1.5

In [2]:
data=pd.DataFrame({
    'name':['a','b','c','d','e'],
    'marks':[200,300,300,400,500]
})
data['rank_average']=data['marks'].rank(ascending=False)
data

#average rank=(prev rank+next rank)/no of ties

NameError: name 'pd' is not defined

In [1]:
data['rank_average']=data['marks'].rank(ascending=True,method='min')
data

NameError: name 'data' is not defined

In [86]:
data['rank_average']=data['marks'].rank(ascending=False,method='max')
data

  name  marks  rank_average
0    a    200           5.0
1    b    300           4.0
2    c    300           4.0
3    d    400           2.0
4    e    500           1.0

In [87]:
data['rank_average']=data['marks'].rank(ascending=False,method='dense')
data

  name  marks  rank_average
0    a    200           4.0
1    b    300           3.0
2    c    300           3.0
3    d    400           2.0
4    e    500           1.0